; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	image2 - mode
	infrared0 - mode
	infrared7 - mode
	spectrograph4 - mode
	image6 - mode
	infrared1 - mode
	image5 - mode
	image3 - mode
	GroundStation3 - direction
	Star4 - direction
	Star7 - direction
	Star6 - direction
	GroundStation0 - direction
	Star2 - direction
	Star5 - direction
	Star1 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
	Star12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(supports instrument0 image2)
	(supports instrument0 infrared1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 Star6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(supports instrument1 image2)
	(supports instrument1 image3)
	(supports instrument1 image6)
	(calibration_target instrument1 Star2)
	(supports instrument2 image5)
	(supports instrument2 spectrograph4)
	(supports instrument2 image3)
	(supports instrument2 infrared7)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 Star5)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star11)
)
(:goal (and
	(have_image Star8 spectrograph4)
	(have_image Star8 infrared0)
	(have_image Planet9 infrared0)
	(have_image Planet10 image6)
	(have_image Planet10 infrared1)
	(have_image Star11 image5)
	(have_image Star12 image2)
	(have_image Star13 image5)
	(have_image Star13 infrared0)
))

)

; plan
1. (turn_to satellite1 star2 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star2)
   goals met: 0 of 9
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 9
3. (calibrate satellite1 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 0 of 9
4. (turn_to satellite1 planet10 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 planet10)
   goals met: 0 of 9
5. (turn_to satellite0 groundstation0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 9
6. (take_image satellite1 planet10 instrument1 image6)
   added: (have_image planet10 image6)
   goals met: 1 of 9
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 9
8. (switch_off instrument1 satellite1)
   deleted: (power_on instrument1)
   added: (power_avail satellite1)
   goals met: 1 of 9
9. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 1 of 9
10. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 9
11. (turn_to satellite0 planet10 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet10)
   goals met: 1 of 9
12. (take_image satellite0 planet10 instrument0 infrared1)
   added: (have_image planet10 infrared1)
   goals met: 2 of 9
13. (turn_to satellite0 planet9 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet9)
   goals met: 2 of 9
14. (take_image satellite0 planet9 instrument0 infrared0)
   added: (have_image planet9 infrared0)
   goals met: 3 of 9
15. (turn_to satellite0 star12 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star12)
   goals met: 3 of 9
16. (take_image satellite0 star12 instrument0 image2)
   added: (have_image star12 image2)
   goals met: 4 of 9
17. (turn_to satellite0 star13 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star13)
   goals met: 4 of 9
18. (take_image satellite0 star13 instrument0 infrared0)
   added: (have_image star13 infrared0)
   goals met: 5 of 9
19. (turn_to satellite0 star8 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star8)
   goals met: 5 of 9
20. (take_image satellite0 star8 instrument0 infrared0)
   added: (have_image star8 infrared0)
   goals met: 6 of 9
21. (take_image satellite0 star8 instrument0 spectrograph4)
   added: (have_image star8 spectrograph4)
   goals met: 7 of 9
22. (turn_to satellite1 star1 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 star1)
   goals met: 7 of 9
23. (calibrate satellite1 instrument2 star1)
   added: (calibrated instrument2)
   goals met: 7 of 9
24. (turn_to satellite1 star11 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 star11)
   goals met: 7 of 9
25. (take_image satellite1 star11 instrument2 image5)
   added: (have_image star11 image5)
   goals met: 8 of 9
26. (turn_to satellite1 star13 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star13)
   goals met: 8 of 9
27. (take_image satellite1 star13 instrument2 image5)
   added: (have_image star13 image5)
   goals met: 9 of 9
